# !/usr/bin/env python
# -*- coding: utf-8 -*-
# ------------------------------
# @project : Py_Project
# @File    : dianping_spider.py
# @Software: PyCharm
# @Author  : Xu
# @Time    : 2021/7/7 16:21
# ------------------------------

'''
    {'tagName': {'glyph00000': ' ', 'x': '.', 'e424': '1', 'e427': '2', 'f119': '3', 'e9da': '4', 'f798': '5', 'ebd5': '6', 'f44b': '7', 'eb0d': '8', 'e92b': '9', 'ee0d': '0', 'e0e9': '店', 'edf3': '中', 'f0a5': '美', 'eeae': '家', 'f4b9': '馆', 'e6c2': '小', 'e8e7': '车', 'ea85': '大', 'ee70': '市', 'ef0e': '公', 'f6f2': '酒', 'f5cb': '行', 'e276': '国', 'e327': '品', 'f6cd': '发', 'ecd2': '电', 'e018': '金', 'e793': '心', 'f120': '业', 'f815': '商', 'e6d9': '司', 'eca3': '超', 'f6a4': '生', 'e0f6': '装', 'e903': '园', 'e086': '场', 'e560': '食', 'f4d5': '有', 'f022': '新', 'eac8': '限', 'f6c6': '天', 'efcb': '面', 'efec': '工', 'e585': '服', 'f569': '海', 'ebae': '华', 'e5e7': '水', 'ebe2': '房', 'f02c': '饰', 'e4f1': '城', 'ec57': '乐', 'f074': '汽', 'f534': '香', 'e46d': '部', 'f421': '利', 'e8ae': '子', 'eb61': '老', 'f489': '艺', 'e3b5': '花', 'e2ee': '专', 'f88c': '东', 'f007': '肉', 'f431': '菜', 'f788': '学', 'e7d5': '福', 'f53f': '饭', 'e5a8': '人', 'eb9a': '百', 'e674': '餐', 'e85a': '茶', 'e557': '务', 'e75d': '通', 'e3ee': '味', 'ead4': '所', 'f026': '山', 'f69f': '区', 'eb13': '门', 'f513': '药', 'f29c': '银', 'ecb2': '农', 'f8a9': '龙', 'eddb': '停', 'e16a': '尚', 'ec87': '安', 'f414': '广', 'eb3b': '鑫', 'ef9a': '一', 'f259': '容', 'f68f': '动', 'e996': '南', 'f34c': '具', 'f8b2': '源', 'e725': '兴', 'f3eb': '鲜', 'f0cd': '记', 'e487': '时', 'e769': '机', 'eb6a': '烤', 'ed33': '文', 'ea97': '康', 'ecf4': '信', 'eed2': '果', 'f23a': '阳', 'f52c': '理', 'f0bb': '锅', 'f25d': '宝', 'e641': '达', 'f578': '地', 'ec3d': '儿', 'e7dc': '衣', 'e4c0': '特', 'ea1a': '产', 'ea4b': '西', 'e1ce': '批', 'e494': '坊', 'f0e0': '州', 'f558': '牛', 'e1a1': '佳', 'e584': '化', 'e4bb': '五', 'e3ed': '米', 'f4ce': '修', 'eb23': '爱', 'f0e8': '北', 'f518': '养', 'e773': '卖', 'f573': '建', 'e73c': '材', 'f10e': '三', 'f606': '会', 'f43f': '鸡', 'ecc2': '室', 'f3a0': '红', 'e3ab': '站', 'e70f': '德', 'f408': '王', 'f287': '光', 'f27e': '名', 'ebfd': '丽', 'e791': '油', 'ef51': '院', 'e7ff': '堂', 'eb69': '烧', 'e115': '江', 'ede6': '社', 'e94e': '合', 'efd5': '星', 'e9b4': '货', 'e124': '型', 'e83f': '村', 'ed31': '自', 'e228': '科', 'f312': '快', 'e768': '便', 'e92a': '日', 'f0bf': '民', 'edd3': '营', 'e3ec': '和', 'f137': '活', 'f13f': '童', 'eb52': '明', 'e34c': '器', 'efd1': '烟', 'f1cc': '育', 'e7c6': '宾', 'f5d5': '精', 'e97f': '屋', 'eb05': '经', 'f2bb': '居', 'f613': '庄', 'e9ae': '石', 'ed81': '顺', 'e5fb': '林', 'e535': '尔', 'e6c1': '县', 'e0ff': '手', 'e3c7': '厅', 'e05f': '销', 'ece9': '用', 'ef58': '好', 'f14c': '客', 'f51b': '火', 'f5f6': '雅', 'f194': '盛', 'ea61': '体', 'f73d': '旅', 'f154': '之', 'f7da': '鞋', 'ef1c': '辣', 'f063': '作', 'e8ab': '粉', 'e225': '包', 'e2f8': '楼', 'efd6': '校', 'efcf': '鱼', 'e667': '平', 'ecd4': '彩', 'eedc': '上', 'ed51': '吧', 'eb31': '保', 'e190': '永', 'e2d9': '万', 'e48a': '物', 'f36b': '教', 'ed2e': '吃', 'e23b': '设', 'e9ca': '医', 'ed7e': '正', 'ee4c': '造', 'e50d': '丰', 'e0eb': '健', 'e40f': '点', 'e352': '汤', 'ee7a': '网', 'e518': '庆', 'f506': '技', 'f04d': '斯', 'f4aa': '洗', 'e24d': '料', 'e213': '配', 'f2dd': '汇', 'e139': '木', 'ed44': '缘', 'e94d': '加', 'e680': '麻', 'f18b': '联', 'ef5a': '卫', 'f1cf': '川', 'f76c': '泰', 'e250': '色', 'f0f5': '世', 'e0f7': '方', 'ef62': '寓', 'f493': '风', 'e619': '幼', 'f750': '羊', 'e704': '烫', 'f023': '来', 'e098': '高', 'f12c': '厂', 'f398': '兰', 'f2f4': '阿', 'e19c': '贝', 'f367': '皮', 'ec0e': '全', 'ebc8': '女', 'f56e': '拉', 'f811': '成', 'e1b2': '云', 'f0c4': '维', 'eb54': '贸', 'e0e5': '道', 'ee4d': '术', 'e783': '运', 'e450': '都', 'f793': '口', 'e021': '博', 'ea2f': '河', 'f7fb': '瑞', 'f03c': '宏', 'e4f9': '京', 'e597': '际', 'f0cb': '路', 'e498': '祥', 'eca9': '青', 'ebd7': '镇', 'e052': '厨', 'e581': '培', 'e685': '力', 'e328': '惠', 'f7fd': '连', 'ee1f': '马', 'e7db': '鸿', 'ecb9': '钢', 'f645': '训', 'eb62': '影', 'f101': '甲', 'efa6': '助', 'f2bd': '窗', 'e99e': '布', 'ef88': '富', 'ea92': '牌', 'f792': '头', 'ee20': '四', 'f4af': '多', 'ea3f': '妆', 'f5ae': '吉', 'eb24': '苑', 'f7a7': '沙', 'f00a': '恒', 'e94a': '隆', 'e7d9': '春', 'f1d4': '干', 'f8e2': '饼', 'e9e4': '氏', 'e490': '里', 'f50e': '二', 'e3da': '管', 'e048': '诚', 'e350': '制', 'f5fc': '售', 'ec72': '嘉', 'f09a': '长', 'f046': '轩', 'f291': '杂', 'f8af': '副', 'f384': '清', 'e616': '计', 'e060': '黄', 'f73a': '讯', 'e491': '太', 'ef8e': '鸭', 'eedd': '号', 'e46f': '街', 'f8fe': '交', 'f372': '与', 'f592': '叉', 'f4a0': '附', 'f88d': '近', 'efa8': '层', 'f630': '旁', 'ede2': '对', 'ed56': '巷', 'f0eb': '栋', 'f136': '环', 'e82b': '省', 'e92f': '桥', 'f79f': '湖', 'e1d9': '段', 'e05b': '乡', 'f30c': '厦', 'f4e5': '府', 'f642': '铺', 'e3bc': '内', 'e047': '侧', 'f070': '元', 'e29d': '购', 'f4e6': '前', 'e610': '幢', 'e05a': '滨', 'edbc': '处', 'e162': '向', 'f066': '座', 'eb2b': '下', 'f317': '臬', 'edfe': '凤', 'eb45': '港', 'ee68': '开', 'eba9': '关', 'e430': '景', 'f6bf': '泉', 'e5f5': '塘', 'e735': '放', 'f502': '昌', 'e68a': '线', 'ea4f': '湾', 'f5a3': '政', 'ef7b': '步', 'e0b2': '宁', 'f612': '解', 'e8bf': '白', 'f27d': '田', 'f284': '町', 'e795': '溪', 'f0d0': '十', 'e9ee': '八', 'f32a': '古', 'e464': '双', 'ed69': '胜', 'e72c': '本', 'e6a3': '单', 'ebc4': '同', 'eb28': '九', 'ef66': '迎', 'e517': '第', 'e468': '台', 'f857': '玉', 'f4d1': '锦', 'f17c': '底', 'f15c': '后', 'e32c': '七', 'f622': '斜', 'f859': '期', 'eb08': '武', 'e033': '岭', 'e9bc': '松', 'ed5f': '角', 'e3a1': '纪', 'e44d': '朝', 'f7a9': '峰', 'f3c0': '六', 'eaab': '振', 'f8d5': '珠', 'f279': '局', 'f7e8': '岗', 'f850': '洲', 'ecfc': '横', 'e4de': '边', 'ea9f': '济', 'e502': '井', 'e41a': '办', 'f773': '汉', 'e281': '代', 'f0d4': '临', 'e9c8': '弄', 'eeb6': '团', 'ee41': '外', 'e563': '塔', 'ed45': '杨', 'e714': '铁', 'e64b': '浦', 'e14d': '字', 'e2b1': '年', 'f8ce': '岛', 'ea93': '陵', 'eac6': '原', 'e690': '梅', 'e7d8': '进', 'ebce': '荣', 'e2b6': '友', 'e6aa': '虹', 'ebd2': '央', 'efc3': '桂', 'e6a7': '沿', 'f447': '事', 'edc3': '津', 'f7a4': '凯', 'f53d': '莲', 'e973': '丁', 'f3c6': '秀', 'f71d': '柳', 'f0fa': '集', 'e434': '紫', 'eaa9': '旗', 'f111': '张', 'efe7': '谷', 'e436': '的', 'f8ab': '是', 'e8d9': '不', 'f02e': '了', 'eccd': '很', 'ef9e': '还', 'f4d2': '个', 'e49b': '也', 'ea83': '这', 'f2ee': '我', 'eefe': '就', 'eaf0': '在', 'e686': '以', 'f580': '可', 'ec30': '到', 'f590': '错', 'e1af': '没', 'ed9b': '去', 'f6f0': '过', 'f2c9': '感', 'ecbb': '次', 'e043': '要', 'ef0d': '比', 'e9c4': '觉', 'ec0b': '看', 'e89f': '得', 'e965': '说', 'f598': '常', 'e998': '真', 'e654': '们', 'e025': '但', 'edf0': '最', 'e88b': '喜', 'efef': '哈', 'e2fa': '么', 'ed2f': '别', 'f50b': '位', 'e850': '能', 'ecde': '较', 'ee52': '境', 'f494': '非', 'e456': '为', 'e1c4': '欢', 'f735': '然', 'f617': '他', 'eaaf': '挺', 'f6e2': '着', 'f5e0': '价', 'e078': '那', 'f1c9': '意', 'e558': '种', 'e7b1': '想', 'e311': '出', 'e997': '员', 'f51a': '两', 'e561': '推', 'e5fc': '做', 'f008': '排', 'e508': '实', 'ebe4': '分', 'f23d': '间', 'f7a5': '甜', 'f1a5': '度', 'f53b': '起', 'e4ea': '满', 'e994': '给', 'f064': '热', 'eb7e': '完', 'f6bd': '格', 'f1fb': '荐', 'ef7c': '喝', 'f73e': '等', 'eec3': '其', 'e815': '再', 'e4e8': '几', 'f286': '只', 'e85d': '现', 'e2d7': '朋', 'f42d': '候', 'ead7': '样', 'f80e': '直', 'ecc0': '而', 'e1ad': '买', 'ee28': '于', 'eb5b': '般', 'ee00': '豆', 'f688': '量', 'ef37': '选', 'f298': '奶', 'ebb7': '打', 'e2dd': '每', 'e6bf': '评', 'e607': '少', 'ee89': '算', 'f192': '又', 'f599': '因', 'e8ff': '情', 'f532': '找', 'e35a': '些', 'e6d5': '份', 'e37d': '置', 'e087': '适', 'e3ac': '什', 'e909': '蛋', 'e03d': '师', 'e04f': '气', 'f6b5': '你', 'ea19': '姐', 'e152': '棒', 'f7c4': '试', 'f8da': '总', 'e8e5': '定', 'eb1f': '啊', 'f187': '足', 'eebf': '级', 'e096': '整', 'e819': '带', 'ea3c': '虾', 'f262': '如', 'f83a': '态', 'e948': '且', 'f8e4': '尝', 'edaf': '主', 'e9dc': '话', 'e8de': '强', 'e2e0': '当', 'edd2': '更', 'e380': '板', 'e76d': '知', 'e5ab': '己', 'f50d': '无', 'f54b': '酸', 'f867': '让', 'e0bd': '入', 'e8fe': '啦', 'e066': '式', 'e031': '笑', 'f3f5': '赞', 'f0ba': '片', 'f459': '酱', 'f1f1': '差', 'e2fd': '像', 'ec19': '提', 'f6d0': '队', 'f74d': '走', 'f01a': '嫩', 'f6b4': '才', 'f1b7': '刚', 'e101': '午', 'f5e8': '接', 'f7b7': '重', 'e9e2': '串', 'e834': '回', 'f7cf': '晚', 'f1e1': '微', 'e1fa': '周', 'f831': '值', 'f226': '费', 'f655': '性', 'e58f': '桌', 'ecff': '拍', 'e542': '跟', 'e7cb': '块', 'f46d': '调', 'e6ac': '糕'}, 'address': {'glyph00000': ' ', 'x': '.', 'f239': '1', 'f69c': '2', 'edf2': '3', 'f5e7': '4', 'f47c': '5', 'f69f': '6', 'e71d': '7', 'e53c': '8', 'e454': '9', 'e51e': '0', 'e3a2': '店', 'e6b9': '中', 'ec0a': '美', 'e88a': '家', 'f819': '馆', 'e639': '小', 'f0eb': '车', 'f575': '大', 'e9da': '市', 'e4e9': '公', 'f73d': '酒', 'ed88': '行', 'f8a6': '国', 'ec6d': '品', 'ed61': '发', 'f3df': '电', 'ec42': '金', 'e49c': '心', 'f8da': '业', 'e3ab': '商', 'e4b9': '司', 'f777': '超', 'f006': '生', 'eaec': '装', 'e7cb': '园', 'e68d': '场', 'e1ca': '食', 'f5ca': '有', 'e41e': '新', 'e49a': '限', 'e536': '天', 'f472': '面', 'eb30': '工', 'f19b': '服', 'e8c6': '海', 'ed00': '华', 'e33e': '水', 'eee2': '房', 'f182': '饰', 'e6f8': '城', 'e25a': '乐', 'e62e': '汽', 'e613': '香', 'f8e0': '部', 'f781': '利', 'ead3': '子', 'e368': '老', 'f83f': '艺', 'ee6c': '花', 'ec5b': '专', 'f67f': '东', 'e5c0': '肉', 'f594': '菜', 'e073': '学', 'f24f': '福', 'f31f': '饭', 'e4de': '人', 'ebe2': '百', 'ebdc': '餐', 'efa2': '茶', 'ecfe': '务', 'f57e': '通', 'e330': '味', 'ef7e': '所', 'f6ba': '山', 'ebb4': '区', 'e40a': '门', 'f2be': '药', 'ee78': '银', 'e816': '农', 'f120': '龙', 'e72b': '停', 'e516': '尚', 'f77d': '安', 'e82f': '广', 'f778': '鑫', 'f2e0': '一', 'f26a': '容', 'e0d5': '动', 'e921': '南', 'eafb': '具', 'f2f8': '源', 'f73f': '兴', 'e80b': '鲜', 'f4f4': '记', 'f0d1': '时', 'ec98': '机', 'f01d': '烤', 'e145': '文', 'f347': '康', 'f419': '信', 'edd7': '果', 'e820': '阳', 'f248': '理', 'e304': '锅', 'e612': '宝', 'e075': '达', 'eceb': '地', 'f327': '儿', 'e728': '衣', 'f232': '特', 'f1e4': '产', 'e235': '西', 'e7b7': '批', 'f664': '坊', 'e2d1': '州', 'f3fb': '牛', 'f201': '佳', 'eba4': '化', 'ef69': '五', 'ebcf': '米', 'e925': '修', 'e7e8': '爱', 'e7cc': '北', 'e55e': '养', 'e500': '卖', 'e0ee': '建', 'f566': '材', 'f48c': '三', 'e8dd': '会', 'ee39': '鸡', 'f0a7': '室', 'ead7': '红', 'ed5e': '站', 'e2b3': '德', 'e213': '王', 'ed55': '光', 'f164': '名', 'f454': '丽', 'e95c': '油', 'e01d': '院', 'e9bd': '堂', 'ed65': '烧', 'e025': '江', 'e0fb': '社', 'e731': '合', 'f36f': '星', 'eba3': '货', 'f68f': '型', 'ea44': '村', 'f6f7': '自', 'eccc': '科', 'f56b': '快', 'e8e3': '便', 'f35a': '日', 'e0d6': '民', 'f71d': '营', 'f30d': '和', 'f258': '活', 'f6b0': '童', 'e737': '明', 'ef35': '器', 'e139': '烟', 'f42c': '育', 'eaa7': '宾', 'e579': '精', 'ec05': '屋', 'e37e': '经', 'f4f2': '居', 'e0f9': '庄', 'e5b6': '石', 'f779': '顺', 'e968': '林', 'e8a5': '尔', 'f46e': '县', 'f883': '手', 'eb58': '厅', 'e522': '销', 'e105': '用', 'e4c5': '好', 'ef42': '客', 'f55e': '火', 'f2c3': '雅', 'f0fa': '盛', 'e20c': '体', 'ea85': '旅', 'e12e': '之', 'e31f': '鞋', 'e337': '辣', 'e301': '作', 'e8d2': '粉', 'f0c0': '包', 'ec6c': '楼', 'ec50': '校', 'f368': '鱼', 'e446': '平', 'e9c4': '彩', 'f4ff': '上', 'e000': '吧', 'ec1e': '保', 'f0e1': '永', 'edeb': '万', 'e01b': '物', 'eda3': '教', 'efb7': '吃', 'e5ad': '设', 'f2ea': '医', 'f41d': '正', 'e3e2': '造', 'f755': '丰', 'eb29': '健', 'f0b9': '点', 'edcd': '汤', 'ec85': '网', 'e083': '庆', 'f4bd': '技', 'e6db': '斯', 'eed1': '洗', 'e0ff': '料', 'e9b1': '配', 'f27f': '汇', 'e822': '木', 'f429': '缘', 'f538': '加', 'f383': '麻', 'e621': '联', 'e3d7': '卫', 'f478': '川', 'e783': '泰', 'eb1d': '色', 'e1c5': '世', 'e6ec': '方', 'e0dc': '寓', 'f6f6': '风', 'ea42': '幼', 'e7a7': '羊', 'e1ec': '烫', 'e540': '来', 'e9eb': '高', 'f29c': '厂', 'ece5': '兰', 'f776': '阿', 'e87e': '贝', 'ef12': '皮', 'f760': '全', 'e7fe': '女', 'f5ea': '拉', 'f5ec': '成', 'e4b5': '云', 'e302': '维', 'f4fa': '贸', 'e4d5': '道', 'e1f4': '术', 'f709': '运', 'ed9a': '都', 'e25d': '口', 'f346': '博', 'e5b2': '河', 'f06c': '瑞', 'f4c4': '宏', 'f3da': '京', 'e92a': '际', 'f101': '路', 'e36e': '祥', 'e264': '青', 'e66a': '镇', 'f602': '厨', 'e05f': '培', 'ee8e': '力', 'f899': '惠', 'e80d': '连', 'e6d1': '马', 'e1c8': '鸿', 'ef20': '钢', 'eaff': '训', 'e468': '影', 'efef': '甲', 'e317': '助', 'f114': '窗', 'f5c0': '布', 'f4f5': '富', 'edc9': '牌', 'e347': '头', 'f05f': '四', 'e272': '多', 'e64d': '妆', 'e02a': '吉', 'f42b': '苑', 'f79f': '沙', 'e77e': '恒', 'e594': '隆', 'f0c1': '春', 'f4ee': '干', 'efa4': '饼', 'e4e0': '氏', 'e2c5': '里', 'ebe8': '二', 'e832': '管', 'e19a': '诚', 'ea0f': '制', 'e6fc': '售', 'f6c9': '嘉', 'ea7b': '长', 'f01f': '轩', 'e144': '杂', 'e5fc': '副', 'f148': '清', 'efd1': '计', 'f411': '黄', 'e6ff': '讯', 'e2c1': '太', 'f17f': '鸭', 'f72f': '号', 'f07a': '街', 'e15b': '交', 'e83e': '与', 'f2cc': '叉', 'e0d4': '附', 'f604': '近', 'e308': '层', 'e788': '旁', 'e370': '对', 'f738': '巷', 'e5b7': '栋', 'e00b': '环', 'ee06': '省', 'e7f3': '桥', 'e73a': '湖', 'e8a9': '段', 'f4f1': '乡', 'ee84': '厦', 'ef22': '府', 'e703': '铺', 'f796': '内', 'e78f': '侧', 'e6f2': '元', 'e257': '购', 'e286': '前', 'e0b0': '幢', 'f0f3': '滨', 'e846': '处', 'f034': '向', 'f17a': '座', 'e5fa': '下', 'f802': '臬', 'eb17': '凤', 'f587': '港', 'e560': '开', 'f2fb': '关', 'f12d': '景', 'e070': '泉', 'ecb0': '塘', 'eee5': '放', 'e504': '昌', 'f4c2': '线', 'e96a': '湾', 'e007': '政', 'f14c': '步', 'e0f8': '宁', 'ebdb': '解', 'ee55': '白', 'e457': '田', 'eeba': '町', 'e21f': '溪', 'f741': '十', 'e246': '八', 'f205': '古', 'ec78': '双', 'eb32': '胜', 'ef29': '本', 'e635': '单', 'e0b1': '同', 'ef89': '九', 'e362': '迎', 'f1ac': '第', 'ea57': '台', 'e355': '玉', 'e40e': '锦', 'ef8b': '底', 'ed48': '后', 'e632': '七', 'e10c': '斜', 'e92b': '期', 'e9d5': '武', 'ecc8': '岭', 'e23e': '松', 'ece6': '角', 'ea3c': '纪', 'e8e6': '朝', 'ec58': '峰', 'ee65': '六', 'e67d': '振', 'eef2': '珠', 'e398': '局', 'ee75': '岗', 'e4b4': '洲', 'e662': '横', 'e07d': '边', 'e715': '济', 'f0e6': '井', 'ec02': '办', 'f082': '汉', 'e74a': '代', 'ed4b': '临', 'ede7': '弄', 'f25e': '团', 'f10d': '外', 'e5af': '塔', 'e067': '杨', 'ebcb': '铁', 'eecf': '浦', 'e1a1': '字', 'e697': '年', 'f816': '岛', 'efad': '陵', 'f0dd': '原', 'e8e1': '梅', 'e6cd': '进', 'ea0a': '荣', 'f71b': '友', 'f7f2': '虹', 'f82c': '央', 'ebc6': '桂', 'e3cc': '沿', 'e6b6': '事', 'e686': '津', 'ef10': '凯', 'f1af': '莲', 'e035': '丁', 'f422': '秀', 'e12b': '柳', 'f3ad': '集', 'e5b1': '紫', 'e8cf': '旗', 'eee0': '张', 'e821': '谷', 'eba1': '的', 'e381': '是', 'e49d': '不', 'eddc': '了', 'e315': '很', 'ecea': '还', 'f6d6': '个', 'e778': '也', 'e328': '这', 'f30b': '我', 'ec6b': '就', 'e3c2': '在', 'f756': '以', 'ee2c': '可', 'f515': '到', 'f095': '错', 'ee72': '没', 'e3cd': '去', 'f804': '过', 'f60f': '感', 'ed20': '次', 'f0d8': '要', 'e5b4': '比', 'f0cb': '觉', 'e610': '看', 'e6aa': '得', 'ef06': '说', 'f7e5': '常', 'e95b': '真', 'e52d': '们', 'f314': '但', 'ed81': '最', 'f2ac': '喜', 'ee4b': '哈', 'e650': '么', 'e8a6': '别', 'e357': '位', 'e969': '能', 'f3b0': '较', 'e727': '境', 'e0a5': '非', 'f49f': '为', 'ed9c': '欢', 'e64e': '然', 'f774': '他', 'eb6d': '挺', 'e4ff': '着', 'e97a': '价', 'edfc': '那', 'e4b0': '意', 'f0fe': '种', 'e75d': '想', 'f392': '出', 'e0f6': '员', 'e6c9': '两', 'f35f': '推', 'f4bc': '做', 'f727': '排', 'f7b1': '实', 'ea7f': '分', 'f2ee': '间', 'f1c3': '甜', 'f405': '度', 'f05a': '起', 'eae9': '满', 'ed79': '给', 'e322': '热', 'e14b': '完', 'f41b': '格', 'e256': '荐', 'e17e': '喝', 'e361': '等', 'f433': '其', 'ec0b': '再', 'e8e8': '几', 'f6f9': '只', 'f6b1': '现', 'f115': '朋', 'e6ca': '候', 'f14f': '样', 'f177': '直', 'e73f': '而', 'f553': '买', 'f3c5': '于', 'e67e': '般', 'efdb': '豆', 'e099': '量', 'ec7e': '选', 'e21a': '奶', 'e849': '打', 'e172': '每', 'f143': '评', 'efa1': '少', 'ec4b': '算', 'e8ba': '又', 'e1e0': '因', 'edfa': '情', 'e92d': '找', 'f2c1': '些', 'e559': '份', 'f69a': '置', 'f519': '适', 'f764': '什', 'eba9': '蛋', 'f088': '师', 'f7e9': '气', 'f696': '你', 'f589': '姐', 'f62e': '棒', 'eb43': '试', 'f592': '总', 'eb39': '定', 'f03b': '啊', 'e2d7': '足', 'e7d9': '级', 'f5e0': '整', 'e9db': '带', 'f5e6': '虾', 'e359': '如', 'f4f3': '态', 'e15a': '且', 'e0b2': '尝', 'ef36': '主', 'f7df': '话', 'f075': '强', 'eed0': '当', 'e4c2': '更', 'e7c2': '板', 'f44e': '知', 'ee89': '己', 'eebd': '无', 'efee': '酸', 'e636': '让', 'eb82': '入', 'e6b2': '啦', 'e180': '式', 'ec4c': '笑', 'e14c': '赞', 'e1e1': '片', 'eb02': '酱', 'f085': '差', 'f025': '像', 'e491': '提', 'e5a1': '队', 'eea2': '走', 'e269': '嫩', 'e81f': '才', 'f6ab': '刚', 'e647': '午', 'f8ed': '接', 'f857': '重', 'ebab': '串', 'e460': '回', 'e51d': '晚', 'eef1': '微', 'e077': '周', 'e9c6': '值', 'e4a5': '费', 'ee74': '性', 'f02f': '桌', 'e3dc': '拍', 'e3fb': '跟', 'f534': '块', 'e4d9': '调', 'e2e2': '糕'}, 'reviewTag': {'glyph00000': ' ', 'x': '.', 'f239': '1', 'f69c': '2', 'edf2': '3', 'f5e7': '4', 'f47c': '5', 'f69f': '6', 'e71d': '7', 'e53c': '8', 'e454': '9', 'e51e': '0', 'e3a2': '店', 'e6b9': '中', 'ec0a': '美', 'e88a': '家', 'f819': '馆', 'e639': '小', 'f0eb': '车', 'f575': '大', 'e9da': '市', 'e4e9': '公', 'f73d': '酒', 'ed88': '行', 'f8a6': '国', 'ec6d': '品', 'ed61': '发', 'f3df': '电', 'ec42': '金', 'e49c': '心', 'f8da': '业', 'e3ab': '商', 'e4b9': '司', 'f777': '超', 'f006': '生', 'eaec': '装', 'e7cb': '园', 'e68d': '场', 'e1ca': '食', 'f5ca': '有', 'e41e': '新', 'e49a': '限', 'e536': '天', 'f472': '面', 'eb30': '工', 'f19b': '服', 'e8c6': '海', 'ed00': '华', 'e33e': '水', 'eee2': '房', 'f182': '饰', 'e6f8': '城', 'e25a': '乐', 'e62e': '汽', 'e613': '香', 'f8e0': '部', 'f781': '利', 'ead3': '子', 'e368': '老', 'f83f': '艺', 'ee6c': '花', 'ec5b': '专', 'f67f': '东', 'e5c0': '肉', 'f594': '菜', 'e073': '学', 'f24f': '福', 'f31f': '饭', 'e4de': '人', 'ebe2': '百', 'ebdc': '餐', 'efa2': '茶', 'ecfe': '务', 'f57e': '通', 'e330': '味', 'ef7e': '所', 'f6ba': '山', 'ebb4': '区', 'e40a': '门', 'f2be': '药', 'ee78': '银', 'e816': '农', 'f120': '龙', 'e72b': '停', 'e516': '尚', 'f77d': '安', 'e82f': '广', 'f778': '鑫', 'f2e0': '一', 'f26a': '容', 'e0d5': '动', 'e921': '南', 'eafb': '具', 'f2f8': '源', 'f73f': '兴', 'e80b': '鲜', 'f4f4': '记', 'f0d1': '时', 'ec98': '机', 'f01d': '烤', 'e145': '文', 'f347': '康', 'f419': '信', 'edd7': '果', 'e820': '阳', 'f248': '理', 'e304': '锅', 'e612': '宝', 'e075': '达', 'eceb': '地', 'f327': '儿', 'e728': '衣', 'f232': '特', 'f1e4': '产', 'e235': '西', 'e7b7': '批', 'f664': '坊', 'e2d1': '州', 'f3fb': '牛', 'f201': '佳', 'eba4': '化', 'ef69': '五', 'ebcf': '米', 'e925': '修', 'e7e8': '爱', 'e7cc': '北', 'e55e': '养', 'e500': '卖', 'e0ee': '建', 'f566': '材', 'f48c': '三', 'e8dd': '会', 'ee39': '鸡', 'f0a7': '室', 'ead7': '红', 'ed5e': '站', 'e2b3': '德', 'e213': '王', 'ed55': '光', 'f164': '名', 'f454': '丽', 'e95c': '油', 'e01d': '院', 'e9bd': '堂', 'ed65': '烧', 'e025': '江', 'e0fb': '社', 'e731': '合', 'f36f': '星', 'eba3': '货', 'f68f': '型', 'ea44': '村', 'f6f7': '自', 'eccc': '科', 'f56b': '快', 'e8e3': '便', 'f35a': '日', 'e0d6': '民', 'f71d': '营', 'f30d': '和', 'f258': '活', 'f6b0': '童', 'e737': '明', 'ef35': '器', 'e139': '烟', 'f42c': '育', 'eaa7': '宾', 'e579': '精', 'ec05': '屋', 'e37e': '经', 'f4f2': '居', 'e0f9': '庄', 'e5b6': '石', 'f779': '顺', 'e968': '林', 'e8a5': '尔', 'f46e': '县', 'f883': '手', 'eb58': '厅', 'e522': '销', 'e105': '用', 'e4c5': '好', 'ef42': '客', 'f55e': '火', 'f2c3': '雅', 'f0fa': '盛', 'e20c': '体', 'ea85': '旅', 'e12e': '之', 'e31f': '鞋', 'e337': '辣', 'e301': '作', 'e8d2': '粉', 'f0c0': '包', 'ec6c': '楼', 'ec50': '校', 'f368': '鱼', 'e446': '平', 'e9c4': '彩', 'f4ff': '上', 'e000': '吧', 'ec1e': '保', 'f0e1': '永', 'edeb': '万', 'e01b': '物', 'eda3': '教', 'efb7': '吃', 'e5ad': '设', 'f2ea': '医', 'f41d': '正', 'e3e2': '造', 'f755': '丰', 'eb29': '健', 'f0b9': '点', 'edcd': '汤', 'ec85': '网', 'e083': '庆', 'f4bd': '技', 'e6db': '斯', 'eed1': '洗', 'e0ff': '料', 'e9b1': '配', 'f27f': '汇', 'e822': '木', 'f429': '缘', 'f538': '加', 'f383': '麻', 'e621': '联', 'e3d7': '卫', 'f478': '川', 'e783': '泰', 'eb1d': '色', 'e1c5': '世', 'e6ec': '方', 'e0dc': '寓', 'f6f6': '风', 'ea42': '幼', 'e7a7': '羊', 'e1ec': '烫', 'e540': '来', 'e9eb': '高', 'f29c': '厂', 'ece5': '兰', 'f776': '阿', 'e87e': '贝', 'ef12': '皮', 'f760': '全', 'e7fe': '女', 'f5ea': '拉', 'f5ec': '成', 'e4b5': '云', 'e302': '维', 'f4fa': '贸', 'e4d5': '道', 'e1f4': '术', 'f709': '运', 'ed9a': '都', 'e25d': '口', 'f346': '博', 'e5b2': '河', 'f06c': '瑞', 'f4c4': '宏', 'f3da': '京', 'e92a': '际', 'f101': '路', 'e36e': '祥', 'e264': '青', 'e66a': '镇', 'f602': '厨', 'e05f': '培', 'ee8e': '力', 'f899': '惠', 'e80d': '连', 'e6d1': '马', 'e1c8': '鸿', 'ef20': '钢', 'eaff': '训', 'e468': '影', 'efef': '甲', 'e317': '助', 'f114': '窗', 'f5c0': '布', 'f4f5': '富', 'edc9': '牌', 'e347': '头', 'f05f': '四', 'e272': '多', 'e64d': '妆', 'e02a': '吉', 'f42b': '苑', 'f79f': '沙', 'e77e': '恒', 'e594': '隆', 'f0c1': '春', 'f4ee': '干', 'efa4': '饼', 'e4e0': '氏', 'e2c5': '里', 'ebe8': '二', 'e832': '管', 'e19a': '诚', 'ea0f': '制', 'e6fc': '售', 'f6c9': '嘉', 'ea7b': '长', 'f01f': '轩', 'e144': '杂', 'e5fc': '副', 'f148': '清', 'efd1': '计', 'f411': '黄', 'e6ff': '讯', 'e2c1': '太', 'f17f': '鸭', 'f72f': '号', 'f07a': '街', 'e15b': '交', 'e83e': '与', 'f2cc': '叉', 'e0d4': '附', 'f604': '近', 'e308': '层', 'e788': '旁', 'e370': '对', 'f738': '巷', 'e5b7': '栋', 'e00b': '环', 'ee06': '省', 'e7f3': '桥', 'e73a': '湖', 'e8a9': '段', 'f4f1': '乡', 'ee84': '厦', 'ef22': '府', 'e703': '铺', 'f796': '内', 'e78f': '侧', 'e6f2': '元', 'e257': '购', 'e286': '前', 'e0b0': '幢', 'f0f3': '滨', 'e846': '处', 'f034': '向', 'f17a': '座', 'e5fa': '下', 'f802': '臬', 'eb17': '凤', 'f587': '港', 'e560': '开', 'f2fb': '关', 'f12d': '景', 'e070': '泉', 'ecb0': '塘', 'eee5': '放', 'e504': '昌', 'f4c2': '线', 'e96a': '湾', 'e007': '政', 'f14c': '步', 'e0f8': '宁', 'ebdb': '解', 'ee55': '白', 'e457': '田', 'eeba': '町', 'e21f': '溪', 'f741': '十', 'e246': '八', 'f205': '古', 'ec78': '双', 'eb32': '胜', 'ef29': '本', 'e635': '单', 'e0b1': '同', 'ef89': '九', 'e362': '迎', 'f1ac': '第', 'ea57': '台', 'e355': '玉', 'e40e': '锦', 'ef8b': '底', 'ed48': '后', 'e632': '七', 'e10c': '斜', 'e92b': '期', 'e9d5': '武', 'ecc8': '岭', 'e23e': '松', 'ece6': '角', 'ea3c': '纪', 'e8e6': '朝', 'ec58': '峰', 'ee65': '六', 'e67d': '振', 'eef2': '珠', 'e398': '局', 'ee75': '岗', 'e4b4': '洲', 'e662': '横', 'e07d': '边', 'e715': '济', 'f0e6': '井', 'ec02': '办', 'f082': '汉', 'e74a': '代', 'ed4b': '临', 'ede7': '弄', 'f25e': '团', 'f10d': '外', 'e5af': '塔', 'e067': '杨', 'ebcb': '铁', 'eecf': '浦', 'e1a1': '字', 'e697': '年', 'f816': '岛', 'efad': '陵', 'f0dd': '原', 'e8e1': '梅', 'e6cd': '进', 'ea0a': '荣', 'f71b': '友', 'f7f2': '虹', 'f82c': '央', 'ebc6': '桂', 'e3cc': '沿', 'e6b6': '事', 'e686': '津', 'ef10': '凯', 'f1af': '莲', 'e035': '丁', 'f422': '秀', 'e12b': '柳', 'f3ad': '集', 'e5b1': '紫', 'e8cf': '旗', 'eee0': '张', 'e821': '谷', 'eba1': '的', 'e381': '是', 'e49d': '不', 'eddc': '了', 'e315': '很', 'ecea': '还', 'f6d6': '个', 'e778': '也', 'e328': '这', 'f30b': '我', 'ec6b': '就', 'e3c2': '在', 'f756': '以', 'ee2c': '可', 'f515': '到', 'f095': '错', 'ee72': '没', 'e3cd': '去', 'f804': '过', 'f60f': '感', 'ed20': '次', 'f0d8': '要', 'e5b4': '比', 'f0cb': '觉', 'e610': '看', 'e6aa': '得', 'ef06': '说', 'f7e5': '常', 'e95b': '真', 'e52d': '们', 'f314': '但', 'ed81': '最', 'f2ac': '喜', 'ee4b': '哈', 'e650': '么', 'e8a6': '别', 'e357': '位', 'e969': '能', 'f3b0': '较', 'e727': '境', 'e0a5': '非', 'f49f': '为', 'ed9c': '欢', 'e64e': '然', 'f774': '他', 'eb6d': '挺', 'e4ff': '着', 'e97a': '价', 'edfc': '那', 'e4b0': '意', 'f0fe': '种', 'e75d': '想', 'f392': '出', 'e0f6': '员', 'e6c9': '两', 'f35f': '推', 'f4bc': '做', 'f727': '排', 'f7b1': '实', 'ea7f': '分', 'f2ee': '间', 'f1c3': '甜', 'f405': '度', 'f05a': '起', 'eae9': '满', 'ed79': '给', 'e322': '热', 'e14b': '完', 'f41b': '格', 'e256': '荐', 'e17e': '喝', 'e361': '等', 'f433': '其', 'ec0b': '再', 'e8e8': '几', 'f6f9': '只', 'f6b1': '现', 'f115': '朋', 'e6ca': '候', 'f14f': '样', 'f177': '直', 'e73f': '而', 'f553': '买', 'f3c5': '于', 'e67e': '般', 'efdb': '豆', 'e099': '量', 'ec7e': '选', 'e21a': '奶', 'e849': '打', 'e172': '每', 'f143': '评', 'efa1': '少', 'ec4b': '算', 'e8ba': '又', 'e1e0': '因', 'edfa': '情', 'e92d': '找', 'f2c1': '些', 'e559': '份', 'f69a': '置', 'f519': '适', 'f764': '什', 'eba9': '蛋', 'f088': '师', 'f7e9': '气', 'f696': '你', 'f589': '姐', 'f62e': '棒', 'eb43': '试', 'f592': '总', 'eb39': '定', 'f03b': '啊', 'e2d7': '足', 'e7d9': '级', 'f5e0': '整', 'e9db': '带', 'f5e6': '虾', 'e359': '如', 'f4f3': '态', 'e15a': '且', 'e0b2': '尝', 'ef36': '主', 'f7df': '话', 'f075': '强', 'eed0': '当', 'e4c2': '更', 'e7c2': '板', 'f44e': '知', 'ee89': '己', 'eebd': '无', 'efee': '酸', 'e636': '让', 'eb82': '入', 'e6b2': '啦', 'e180': '式', 'ec4c': '笑', 'e14c': '赞', 'e1e1': '片', 'eb02': '酱', 'f085': '差', 'f025': '像', 'e491': '提', 'e5a1': '队', 'eea2': '走', 'e269': '嫩', 'e81f': '才', 'f6ab': '刚', 'e647': '午', 'f8ed': '接', 'f857': '重', 'ebab': '串', 'e460': '回', 'e51d': '晚', 'eef1': '微', 'e077': '周', 'e9c6': '值', 'e4a5': '费', 'ee74': '性', 'f02f': '桌', 'e3dc': '拍', 'e3fb': '跟', 'f534': '块', 'e4d9': '调', 'e2e2': '糕'}, 'shopNum': {'glyph00000': ' ', 'x': '.', 'e424': '1', 'e427': '2', 'f119': '3', 'e9da': '4', 'f798': '5', 'ebd5': '6', 'f44b': '7', 'eb0d': '8', 'e92b': '9', 'ee0d': '0', 'e0e9': '店', 'edf3': '中', 'f0a5': '美', 'eeae': '家', 'f4b9': '馆', 'e6c2': '小', 'e8e7': '车', 'ea85': '大', 'ee70': '市', 'ef0e': '公', 'f6f2': '酒', 'f5cb': '行', 'e276': '国', 'e327': '品', 'f6cd': '发', 'ecd2': '电', 'e018': '金', 'e793': '心', 'f120': '业', 'f815': '商', 'e6d9': '司', 'eca3': '超', 'f6a4': '生', 'e0f6': '装', 'e903': '园', 'e086': '场', 'e560': '食', 'f4d5': '有', 'f022': '新', 'eac8': '限', 'f6c6': '天', 'efcb': '面', 'efec': '工', 'e585': '服', 'f569': '海', 'ebae': '华', 'e5e7': '水', 'ebe2': '房', 'f02c': '饰', 'e4f1': '城', 'ec57': '乐', 'f074': '汽', 'f534': '香', 'e46d': '部', 'f421': '利', 'e8ae': '子', 'eb61': '老', 'f489': '艺', 'e3b5': '花', 'e2ee': '专', 'f88c': '东', 'f007': '肉', 'f431': '菜', 'f788': '学', 'e7d5': '福', 'f53f': '饭', 'e5a8': '人', 'eb9a': '百', 'e674': '餐', 'e85a': '茶', 'e557': '务', 'e75d': '通', 'e3ee': '味', 'ead4': '所', 'f026': '山', 'f69f': '区', 'eb13': '门', 'f513': '药', 'f29c': '银', 'ecb2': '农', 'f8a9': '龙', 'eddb': '停', 'e16a': '尚', 'ec87': '安', 'f414': '广', 'eb3b': '鑫', 'ef9a': '一', 'f259': '容', 'f68f': '动', 'e996': '南', 'f34c': '具', 'f8b2': '源', 'e725': '兴', 'f3eb': '鲜', 'f0cd': '记', 'e487': '时', 'e769': '机', 'eb6a': '烤', 'ed33': '文', 'ea97': '康', 'ecf4': '信', 'eed2': '果', 'f23a': '阳', 'f52c': '理', 'f0bb': '锅', 'f25d': '宝', 'e641': '达', 'f578': '地', 'ec3d': '儿', 'e7dc': '衣', 'e4c0': '特', 'ea1a': '产', 'ea4b': '西', 'e1ce': '批', 'e494': '坊', 'f0e0': '州', 'f558': '牛', 'e1a1': '佳', 'e584': '化', 'e4bb': '五', 'e3ed': '米', 'f4ce': '修', 'eb23': '爱', 'f0e8': '北', 'f518': '养', 'e773': '卖', 'f573': '建', 'e73c': '材', 'f10e': '三', 'f606': '会', 'f43f': '鸡', 'ecc2': '室', 'f3a0': '红', 'e3ab': '站', 'e70f': '德', 'f408': '王', 'f287': '光', 'f27e': '名', 'ebfd': '丽', 'e791': '油', 'ef51': '院', 'e7ff': '堂', 'eb69': '烧', 'e115': '江', 'ede6': '社', 'e94e': '合', 'efd5': '星', 'e9b4': '货', 'e124': '型', 'e83f': '村', 'ed31': '自', 'e228': '科', 'f312': '快', 'e768': '便', 'e92a': '日', 'f0bf': '民', 'edd3': '营', 'e3ec': '和', 'f137': '活', 'f13f': '童', 'eb52': '明', 'e34c': '器', 'efd1': '烟', 'f1cc': '育', 'e7c6': '宾', 'f5d5': '精', 'e97f': '屋', 'eb05': '经', 'f2bb': '居', 'f613': '庄', 'e9ae': '石', 'ed81': '顺', 'e5fb': '林', 'e535': '尔', 'e6c1': '县', 'e0ff': '手', 'e3c7': '厅', 'e05f': '销', 'ece9': '用', 'ef58': '好', 'f14c': '客', 'f51b': '火', 'f5f6': '雅', 'f194': '盛', 'ea61': '体', 'f73d': '旅', 'f154': '之', 'f7da': '鞋', 'ef1c': '辣', 'f063': '作', 'e8ab': '粉', 'e225': '包', 'e2f8': '楼', 'efd6': '校', 'efcf': '鱼', 'e667': '平', 'ecd4': '彩', 'eedc': '上', 'ed51': '吧', 'eb31': '保', 'e190': '永', 'e2d9': '万', 'e48a': '物', 'f36b': '教', 'ed2e': '吃', 'e23b': '设', 'e9ca': '医', 'ed7e': '正', 'ee4c': '造', 'e50d': '丰', 'e0eb': '健', 'e40f': '点', 'e352': '汤', 'ee7a': '网', 'e518': '庆', 'f506': '技', 'f04d': '斯', 'f4aa': '洗', 'e24d': '料', 'e213': '配', 'f2dd': '汇', 'e139': '木', 'ed44': '缘', 'e94d': '加', 'e680': '麻', 'f18b': '联', 'ef5a': '卫', 'f1cf': '川', 'f76c': '泰', 'e250': '色', 'f0f5': '世', 'e0f7': '方', 'ef62': '寓', 'f493': '风', 'e619': '幼', 'f750': '羊', 'e704': '烫', 'f023': '来', 'e098': '高', 'f12c': '厂', 'f398': '兰', 'f2f4': '阿', 'e19c': '贝', 'f367': '皮', 'ec0e': '全', 'ebc8': '女', 'f56e': '拉', 'f811': '成', 'e1b2': '云', 'f0c4': '维', 'eb54': '贸', 'e0e5': '道', 'ee4d': '术', 'e783': '运', 'e450': '都', 'f793': '口', 'e021': '博', 'ea2f': '河', 'f7fb': '瑞', 'f03c': '宏', 'e4f9': '京', 'e597': '际', 'f0cb': '路', 'e498': '祥', 'eca9': '青', 'ebd7': '镇', 'e052': '厨', 'e581': '培', 'e685': '力', 'e328': '惠', 'f7fd': '连', 'ee1f': '马', 'e7db': '鸿', 'ecb9': '钢', 'f645': '训', 'eb62': '影', 'f101': '甲', 'efa6': '助', 'f2bd': '窗', 'e99e': '布', 'ef88': '富', 'ea92': '牌', 'f792': '头', 'ee20': '四', 'f4af': '多', 'ea3f': '妆', 'f5ae': '吉', 'eb24': '苑', 'f7a7': '沙', 'f00a': '恒', 'e94a': '隆', 'e7d9': '春', 'f1d4': '干', 'f8e2': '饼', 'e9e4': '氏', 'e490': '里', 'f50e': '二', 'e3da': '管', 'e048': '诚', 'e350': '制', 'f5fc': '售', 'ec72': '嘉', 'f09a': '长', 'f046': '轩', 'f291': '杂', 'f8af': '副', 'f384': '清', 'e616': '计', 'e060': '黄', 'f73a': '讯', 'e491': '太', 'ef8e': '鸭', 'eedd': '号', 'e46f': '街', 'f8fe': '交', 'f372': '与', 'f592': '叉', 'f4a0': '附', 'f88d': '近', 'efa8': '层', 'f630': '旁', 'ede2': '对', 'ed56': '巷', 'f0eb': '栋', 'f136': '环', 'e82b': '省', 'e92f': '桥', 'f79f': '湖', 'e1d9': '段', 'e05b': '乡', 'f30c': '厦', 'f4e5': '府', 'f642': '铺', 'e3bc': '内', 'e047': '侧', 'f070': '元', 'e29d': '购', 'f4e6': '前', 'e610': '幢', 'e05a': '滨', 'edbc': '处', 'e162': '向', 'f066': '座', 'eb2b': '下', 'f317': '臬', 'edfe': '凤', 'eb45': '港', 'ee68': '开', 'eba9': '关', 'e430': '景', 'f6bf': '泉', 'e5f5': '塘', 'e735': '放', 'f502': '昌', 'e68a': '线', 'ea4f': '湾', 'f5a3': '政', 'ef7b': '步', 'e0b2': '宁', 'f612': '解', 'e8bf': '白', 'f27d': '田', 'f284': '町', 'e795': '溪', 'f0d0': '十', 'e9ee': '八', 'f32a': '古', 'e464': '双', 'ed69': '胜', 'e72c': '本', 'e6a3': '单', 'ebc4': '同', 'eb28': '九', 'ef66': '迎', 'e517': '第', 'e468': '台', 'f857': '玉', 'f4d1': '锦', 'f17c': '底', 'f15c': '后', 'e32c': '七', 'f622': '斜', 'f859': '期', 'eb08': '武', 'e033': '岭', 'e9bc': '松', 'ed5f': '角', 'e3a1': '纪', 'e44d': '朝', 'f7a9': '峰', 'f3c0': '六', 'eaab': '振', 'f8d5': '珠', 'f279': '局', 'f7e8': '岗', 'f850': '洲', 'ecfc': '横', 'e4de': '边', 'ea9f': '济', 'e502': '井', 'e41a': '办', 'f773': '汉', 'e281': '代', 'f0d4': '临', 'e9c8': '弄', 'eeb6': '团', 'ee41': '外', 'e563': '塔', 'ed45': '杨', 'e714': '铁', 'e64b': '浦', 'e14d': '字', 'e2b1': '年', 'f8ce': '岛', 'ea93': '陵', 'eac6': '原', 'e690': '梅', 'e7d8': '进', 'ebce': '荣', 'e2b6': '友', 'e6aa': '虹', 'ebd2': '央', 'efc3': '桂', 'e6a7': '沿', 'f447': '事', 'edc3': '津', 'f7a4': '凯', 'f53d': '莲', 'e973': '丁', 'f3c6': '秀', 'f71d': '柳', 'f0fa': '集', 'e434': '紫', 'eaa9': '旗', 'f111': '张', 'efe7': '谷', 'e436': '的', 'f8ab': '是', 'e8d9': '不', 'f02e': '了', 'eccd': '很', 'ef9e': '还', 'f4d2': '个', 'e49b': '也', 'ea83': '这', 'f2ee': '我', 'eefe': '就', 'eaf0': '在', 'e686': '以', 'f580': '可', 'ec30': '到', 'f590': '错', 'e1af': '没', 'ed9b': '去', 'f6f0': '过', 'f2c9': '感', 'ecbb': '次', 'e043': '要', 'ef0d': '比', 'e9c4': '觉', 'ec0b': '看', 'e89f': '得', 'e965': '说', 'f598': '常', 'e998': '真', 'e654': '们', 'e025': '但', 'edf0': '最', 'e88b': '喜', 'efef': '哈', 'e2fa': '么', 'ed2f': '别', 'f50b': '位', 'e850': '能', 'ecde': '较', 'ee52': '境', 'f494': '非', 'e456': '为', 'e1c4': '欢', 'f735': '然', 'f617': '他', 'eaaf': '挺', 'f6e2': '着', 'f5e0': '价', 'e078': '那', 'f1c9': '意', 'e558': '种', 'e7b1': '想', 'e311': '出', 'e997': '员', 'f51a': '两', 'e561': '推', 'e5fc': '做', 'f008': '排', 'e508': '实', 'ebe4': '分', 'f23d': '间', 'f7a5': '甜', 'f1a5': '度', 'f53b': '起', 'e4ea': '满', 'e994': '给', 'f064': '热', 'eb7e': '完', 'f6bd': '格', 'f1fb': '荐', 'ef7c': '喝', 'f73e': '等', 'eec3': '其', 'e815': '再', 'e4e8': '几', 'f286': '只', 'e85d': '现', 'e2d7': '朋', 'f42d': '候', 'ead7': '样', 'f80e': '直', 'ecc0': '而', 'e1ad': '买', 'ee28': '于', 'eb5b': '般', 'ee00': '豆', 'f688': '量', 'ef37': '选', 'f298': '奶', 'ebb7': '打', 'e2dd': '每', 'e6bf': '评', 'e607': '少', 'ee89': '算', 'f192': '又', 'f599': '因', 'e8ff': '情', 'f532': '找', 'e35a': '些', 'e6d5': '份', 'e37d': '置', 'e087': '适', 'e3ac': '什', 'e909': '蛋', 'e03d': '师', 'e04f': '气', 'f6b5': '你', 'ea19': '姐', 'e152': '棒', 'f7c4': '试', 'f8da': '总', 'e8e5': '定', 'eb1f': '啊', 'f187': '足', 'eebf': '级', 'e096': '整', 'e819': '带', 'ea3c': '虾', 'f262': '如', 'f83a': '态', 'e948': '且', 'f8e4': '尝', 'edaf': '主', 'e9dc': '话', 'e8de': '强', 'e2e0': '当', 'edd2': '更', 'e380': '板', 'e76d': '知', 'e5ab': '己', 'f50d': '无', 'f54b': '酸', 'f867': '让', 'e0bd': '入', 'e8fe': '啦', 'e066': '式', 'e031': '笑', 'f3f5': '赞', 'f0ba': '片', 'f459': '酱', 'f1f1': '差', 'e2fd': '像', 'ec19': '提', 'f6d0': '队', 'f74d': '走', 'f01a': '嫩', 'f6b4': '才', 'f1b7': '刚', 'e101': '午', 'f5e8': '接', 'f7b7': '重', 'e9e2': '串', 'e834': '回', 'f7cf': '晚', 'f1e1': '微', 'e1fa': '周', 'f831': '值', 'f226': '费', 'f655': '性', 'e58f': '桌', 'ecff': '拍', 'e542': '跟', 'e7cb': '块', 'f46d': '调', 'e6ac': '糕'}}
'''
'''

    1.字体反爬位置的标签所在，评价数量，人均价格，商品标签，店铺地址，商品评价分数，观察标签绑定的属性
    查看访问页面的，查看页面中的加密标签，经分析，有三种class标签的字符是加密过的
    （tagName, address, shopNum）

    2.通过点击该标签，找到css或js加密文件，进行解密

    3.分析css文件，点击绑定的url，自动下载字体文件，得到字体的译文

    4.得到译文之后，提取原源码的字体加密密文，通过对比，解析译文

    5.使用ua大列表突破反爬
    
    6.使用ip代理
        
'''
# 字体工具包
from fontTools.ttLib import TTFont
from requests_html import HTMLSession
from fake_useragent import UserAgent
from openpyxl import Workbook
from lxml import etree
import re, os, random, time

session = HTMLSession()
ua = UserAgent()

agent_list = [
    'Mozilla/4.0(compatible;MSIE7.0;WindowsNT5.1;AvantBrowser)',
    'Mozilla/4.0(compatible;MSIE7.0;WindowsNT5.1;360SE)',
    'Mozilla/4.0(compatible;MSIE7.0;WindowsNT5.1;Trident/4.0;SE2.XMetaSr1.0;SE2.XMetaSr1.0;.NETCLR2.0.50727;SE2.XMetaSr1.0)',
    'Mozilla/4.0(compatible;MSIE7.0;WindowsNT5.1;TheWorld)',
    'Mozilla/4.0(compatible;MSIE7.0;WindowsNT5.1;TencentTraveler4.0)',
    'Opera/9.80(Macintosh;IntelMacOSX10.6.8;U;en)Presto/2.8.131Version/11.11',
    'Mozilla/5.0(WindowsNT6.1;rv:2.0.1)Gecko/20100101Firefox/4.0.1',
    'Mozilla/5.0(compatible;MSIE9.0;WindowsNT6.1;Trident/5.0',
    'Mozilla/5.0 (Windows NT 6.1; WOW64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/39.0.2171.95 Safari/537.36 OPR/26.0.1656.60',
    'Mozilla/5.0 (Windows NT 6.1; WOW64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/30.0.1599.101 Safari/537.36',
    'Mozilla/4.0 (compatible; MSIE 6.0; Windows NT 5.1; SV1; QQDownload 732; .NET4.0C; .NET4.0E; LBBROWSER)',
    'Mozilla/5.0 (Windows NT 5.1) AppleWebKit/535.11 (KHTML, like Gecko) Chrome/17.0.963.84 Safari/535.11 SE 2.X MetaSr 1.0',
    'Mozilla/5.0 (Windows NT 6.1; WOW64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/38.0.2125.122 UBrowser/4.0.3214.0 Safari/537.36',
    'Mozilla/5.0 (X11; U; Linux x86_64; zh-CN; rv:1.9.2.10) Gecko/20100922 Ubuntu/10.10 (maverick) Firefox/3.6.10',
    'Mozilla/5.0 (Windows NT 6.1; WOW64) AppleWebKit/535.1 (KHTML, like Gecko) Chrome/14.0.835.163 Safari/535.1',
    "Mozilla/4.0 (compatible; MSIE 6.0; Windows NT 5.1; SV1; AcooBrowser; .NET CLR 1.1.4322; .NET CLR 2.0.50727)",
    "Mozilla/4.0 (compatible; MSIE 7.0; Windows NT 6.0; Acoo Browser; SLCC1; .NET CLR 2.0.50727; Media Center PC 5.0; .NET CLR 3.0.04506)",
    "Mozilla/4.0 (compatible; MSIE 7.0; AOL 9.5; AOLBuild 4337.35; Windows NT 5.1; .NET CLR 1.1.4322; .NET CLR 2.0.50727)",
    "Mozilla/5.0 (Windows; U; MSIE 9.0; Windows NT 9.0; en-US)",
    "Mozilla/5.0 (compatible; MSIE 9.0; Windows NT 6.1; Win64; x64; Trident/5.0; .NET CLR 3.5.30729; .NET CLR 3.0.30729; .NET CLR 2.0.50727; Media Center PC 6.0)",
    "Mozilla/5.0 (compatible; MSIE 8.0; Windows NT 6.0; Trident/4.0; WOW64; Trident/4.0; SLCC2; .NET CLR 2.0.50727; .NET CLR 3.5.30729; .NET CLR 3.0.30729; .NET CLR 1.0.3705; .NET CLR 1.1.4322)",
    "Mozilla/4.0 (compatible; MSIE 7.0b; Windows NT 5.2; .NET CLR 1.1.4322; .NET CLR 2.0.50727; InfoPath.2; .NET CLR 3.0.04506.30)",
    "Mozilla/5.0 (Windows; U; Windows NT 5.1; zh-CN) AppleWebKit/523.15 (KHTML, like Gecko, Safari/419.3) Arora/0.3 (Change: 287 c9dfb30)",
    "Mozilla/5.0 (X11; U; Linux; en-US) AppleWebKit/527+ (KHTML, like Gecko, Safari/419.3) Arora/0.6",
    "Mozilla/5.0 (Windows; U; Windows NT 5.1; en-US; rv:1.8.1.2pre) Gecko/20070215 K-Ninja/2.1.1",
    "Mozilla/5.0 (Windows; U; Windows NT 5.1; zh-CN; rv:1.9) Gecko/20080705 Firefox/3.0 Kapiko/3.0",
    "Mozilla/5.0 (X11; Linux i686; U;) Gecko/20070322 Kazehakase/0.4.5",
    "Mozilla/5.0 (X11; U; Linux i686; en-US; rv:1.9.0.8) Gecko Fedora/1.9.0.8-1.fc10 Kazehakase/0.5.6",
    "Mozilla/5.0 (Windows NT 6.1; WOW64) AppleWebKit/535.11 (KHTML, like Gecko) Chrome/17.0.963.56 Safari/535.11",
    "Mozilla/5.0 (Macintosh; Intel Mac OS X 10_7_3) AppleWebKit/535.20 (KHTML, like Gecko) Chrome/19.0.1036.7 Safari/535.20",
    "Opera/9.80 (Macintosh; Intel Mac OS X 10.6.8; U; fr) Presto/2.9.168 Version/11.52",
]

class DZspider(object):
    def __init__(self):
        self.css_font_url = 'http://s3plus.meituan.net/v1/mss_0a06a471f9514fc79c981b5466f56b91/svgtextcss/91fac2513ba583139581ce8814d61668.css'
        self.start_url = 'http://www.dianping.com/guangzhou/ch10/g116p{}'
        self.headers = {
            'user-agent': ua.chrome
        }
        # 创建文件夹
        self.os_path = os.getcwd() + '/字体/'
        os.makedirs(self.os_path, exist_ok=True)
        # 创建Workbook对象
        self.wb = Workbook()
        self.sheet = self.wb.active
        self.sheet.append(['店铺名称', '评价数', '标签', '人均价格', '地址', '推荐菜', '口味', '环境', '服务'])

    def parse_css_font_url(self):
        '''
        解析字体css文件
        :return:
        '''
        response = session.get(self.css_font_url, headers=self.headers).content.decode()
        # print(response)
        font_info_list = re.findall(
            r'font-family: "(.*?)";src:.*?(//s3plus\.meituan\.net/v1/mss_73a511b8f91f43d0bdae92584ea6330b/font/\w+.woff)',
            response)
        '''获取字体标签名称，字体文件url'''
        # print(font_info_list)
        font_name_list = [font[0].split('-')[-1] for font in font_info_list]
        font_url_list = ['https:' + font[1] for font in font_info_list]
        # 创建字体字典，根据字体加密的种类，对应字体的数据解析
        class_name_dict = {}
        for font_name, font_url in zip(font_name_list, font_url_list):
            # print(font_name, font_url)
            self.parse_font_url(font_name, font_url, class_name_dict)
            # pass
        print(class_name_dict)
        self.parse_start_url(class_name_dict)

    def parse_font_url(self, font_name, font_url, class_name_dict):
        '''
        解析字体文件，获取字体编码信息
        :param font_name: 标签名称
        :param font_url: 字体解析url
        :return:
        '''
        # 获取字体url响应
        response = session.get(font_url).content
        '''1.创建未解析的字体文件的名称和路径'''
        file_path = self.os_path + font_name + '.woff'
        with open(file_path, 'wb')as f:
            f.write(response)
        '''解析字体'''
        font_data = TTFont(file_path)
        file_path_2 = self.os_path + '解析-' + font_name + '.woff'
        font_data.saveXML(file_path_2)
        '''        
         网页源码中的字体 &#xf7c6                               英文
         下载下来的字体文件通过字体工具打开  0123456789我爱你      中文
         字体译文源码结构                                       拼音
        '''
        # 从xml字体源码取出所有的name值
        '''字体译文源码'''
        gly_list = font_data.getGlyphOrder()
        words = ' .1234567890店中美家馆小车大市公酒行国品发电金心业商司超生装园场食有新限天面工服海华水房饰城乐汽香部利子老艺花专东肉菜学福饭人百餐茶务通味所山区门药银农龙停尚安广鑫一容动南具源兴鲜记时机烤文康信果阳理锅宝达地儿衣特产西批坊州牛佳化五米修爱北养卖建材三会鸡室红站德王光名丽油院堂烧江社合星货型村自科快便日民营和活童明器烟育宾精屋经居庄石顺林尔县手厅销用好客火雅盛体旅之鞋辣作粉包楼校鱼平彩上吧保永万物教吃设医正造丰健点汤网庆技斯洗料配汇木缘加麻联卫川泰色世方寓风幼羊烫来高厂兰阿贝皮全女拉成云维贸道术运都口博河瑞宏京际路祥青镇厨培力惠连马鸿钢训影甲助窗布富牌头四多妆吉苑沙恒隆春干饼氏里二管诚制售嘉长轩杂副清计黄讯太鸭号街交与叉附近层旁对巷栋环省桥湖段乡厦府铺内侧元购前幢滨处向座下臬凤港开关景泉塘放昌线湾政步宁解白田町溪十八古双胜本单同九迎第台玉锦底后七斜期武岭松角纪朝峰六振珠局岗洲横边济井办汉代临弄团外塔杨铁浦字年岛陵原梅进荣友虹央桂沿事津凯莲丁秀柳集紫旗张谷的是不了很还个也这我就在以可到错没去过感次要比觉看得说常真们但最喜哈么别位能较境非为欢然他挺着价那意种想出员两推做排实分间甜度起满给热完格荐喝等其再几只现朋候样直而买于般豆量选奶打每评少算又因情找些份置适什蛋师气你姐棒试总定啊足级整带虾如态且尝主话强当更板知己无酸让入啦式笑赞片酱差像提队走嫩才刚午接重串回晚微周值费性桌拍跟块调糕'
        '''创建字典保存字体译文'''
        font_dict = {}
        for index, word in enumerate(words):
            if index <= 1:
                font_dict[gly_list[index]] = word
            else:
                font_dict[gly_list[index][3:]] = word
        '''用字典嵌套保存根据class_name分类'''
        class_name_dict[font_name] = font_dict


    def parse_start_url(self, class_name_dict):
        '''
        解析起始url地址，获取店铺信息
        :param class_name_dict: 突破字体反爬大字典
        :return:
        '''

        # 构造新的headers
        headers = {
            'user-agent': random.choice(agent_list),
            'Cookie': 'fspop=test; cy=4; cye=guangzhou; _lxsdk_cuid=17a7f8c6f9bc8-0e43fda8a4f05b-6373264-144000-17a7f8c6f9bc8; _lxsdk=17a7f8c6f9bc8-0e43fda8a4f05b-6373264-144000-17a7f8c6f9bc8; _hc.v=64bad4b4-8d73-881e-cdf2-4cac951d9856.1625637548; cityInfo=%7B%22cityId%22%3A4%2C%22cityName%22%3A%22%E5%B9%BF%E5%B7%9E%22%2C%22provinceId%22%3A0%2C%22parentCityId%22%3A0%2C%22cityOrderId%22%3A0%2C%22isActiveCity%22%3Afalse%2C%22cityEnName%22%3A%22guangzhou%22%2C%22cityPyName%22%3Anull%2C%22cityAreaCode%22%3Anull%2C%22cityAbbrCode%22%3Anull%2C%22isOverseasCity%22%3Afalse%2C%22isScenery%22%3Afalse%2C%22TuanGouFlag%22%3A0%2C%22cityLevel%22%3A0%2C%22appHotLevel%22%3A0%2C%22gLat%22%3A0%2C%22gLng%22%3A0%2C%22directURL%22%3Anull%2C%22standardEnName%22%3Anull%7D; s_ViewType=10; ua=%E7%9B%97%E7%B2%89%E7%94%B7%E5%AD%A9; ctu=b18e27324623a782b25d41417139a5dc359f9980e84a48a4fba6a7714778cdff; _lx_utm=utm_source%3DBaidu%26utm_medium%3Dorganic; thirdtoken=f4773ec7-d31e-4587-bdaf-e59ae308d8eb; dper=3fba42a39fb09e8b101a679e1bddd373b7718eedecbf2049e37ad59745ceb12bc508655190fe7c43523dced30738db8bf5389a258d499bc62ca5f665a7f612a664ff423b03334ddfce415a8c8dbc5ab640f6379d370e25b823ee96acf0d872bc; ll=7fd06e815b796be3df069dec7836c3df; ctu=f8b38874d1465319f67a69bf929175711c6446e4a14dc595a4c18111bf7d4e16b092cb39fd6659f6523aa0059cc7f56a; Hm_lvt_602b80cf8079ae6591966cc70a3940e7=1625668938,1625714291,1625720063,1625720085; dplet=f2a1edb74b8624e8438a572ad7bd6b20; Hm_lpvt_602b80cf8079ae6591966cc70a3940e7=1625720089; _lxsdk_s=17a8477852f-32b-cbc-9c4%7C%7C37',
            'Host': 'www.dianping.com',
            'Referer': 'http://www.dianping.com/',
            'sec-ch-ua': '" Not;A Brand";v="99", "Google Chrome";v="91", "Chromium";v="91"',
            'Upgrade-Insecure-Requests': '1'

        }
        for i in range(1, 3):
            response = session.get(self.start_url.format(i), headers=headers).content.decode()
            # print(response)
            html = etree.HTML(response)
            # 提取父一级节点标签
            li_list = html.xpath('//*[@id="shop-all-list"]/ul/li')
            data_list = []
            for div in li_list:
                '''店铺名称'''
                title = ''.join(div.xpath('./div[2]/div[1]/a[1]/h4/text()'))
                data_list.append(title)
                '''评价数'''
                comment_num = div.xpath('./div[2]/div[2]/a[1]/b/svgmtsi[@class="shopNum"]/text()')
                comment_num = self.tanslate_content(comment_num, class_name_dict, "shopNum")
                data_list.append(comment_num)
                '''标签'''
                tag = div.xpath('./div[2]/div[3]/a[1]/span/svgmtsi[@class="tagName"]/text()')
                tag = self.tanslate_content(tag, class_name_dict, "tagName")
                data_list.append(tag)
                '''人均价格'''
                price = div.xpath('./div[2]/div[2]/a[2]/b//text()')
                price = self.tanslate_content(price, class_name_dict, "shopNum")
                data_list.append(price)

                '''地址'''
                # 街道
                address_1 = div.xpath('./div[2]/div[3]/a[2]/span[@class="tag"]//text()')
                address_1 = self.tanslate_content(address_1, class_name_dict, "tagName")
                # 详细地址
                address_2 = div.xpath('./div[2]/div[3]/span[@class="addr"]//text()')
                address_2 = self.tanslate_content(address_2, class_name_dict, "address")
                address = address_1 + '-' + address_2
                data_list.append(address)
                '''推荐菜'''
                menus = ','.join(div.xpath('.//div[2]/div[4]/a/text()'))
                data_list.append(menus)
                '''口味'''
                taste = div.xpath('./div[2]/span/span[1]/b//text()')
                taste = self.tanslate_content(taste, class_name_dict, "shopNum")
                data_list.append(taste)
                '''环境'''
                environment = div.xpath('./div[2]/span/span[2]/b//text()')
                environment = self.tanslate_content(environment, class_name_dict, "shopNum")
                data_list.append(environment)
                '''服务'''
                service = div.xpath('./div[2]/span/span[3]/b//text()')
                service = self.tanslate_content(service, class_name_dict, "shopNum")
                data_list.append(service)
                print(title, comment_num, price, address, menus, taste, environment, service)
                # print(title, comment_num, price, tag,  address_1, address_2 ,address)
                print(data_list)
                self.save_content_info(data_list)
                data_list = []
                time.sleep(3)

    def tanslate_content(self, data, class_name_dict, class_name):
        '''
        解析网页源码字体，通过字典取值，翻译字体
        :param data:            需解密的字体
        :param class_name_dict: 突破字体反爬大字典
        :param class_name:      标签名称，区分不同的字体类型解密
        :return:
        '''
        list_1 = []
        for index, cont_str in enumerate(data):
            # repr防止被转义
            res = repr(cont_str).replace(r'\u', '').replace("'", '')
            # print(len(res), res, type(res))
            if len(res) != 4:
                list_1.append(res)
            else:
                try:
                    result = class_name_dict[class_name][res]
                    list_1.append(result)
                except Exception as e:
                    print(e)
                    list_1.append(res)
        # print(list_1)
        content = ''.join(list_1)
        # print(content)
        return content

    def save_content_info(self, data_list):
        self.sheet.append(data_list)
        print('******数据添加成功******')

    def main(self):
        self.parse_css_font_url()
        self.wb.save('DZspider.xlsx')

if __name__ == '__main__':
    dz = DZspider()
    dz.main()
